public/IT/Docwriting/Sysanalyses/Notation/UML/State/README.md
```
stateDiagram

    state "Открыта" as Opened
    state "В работе" as InProgress
    state "На проверке" as InReview
    state "Возвращена" as Reopened
    state "Проверена" as Passed
    state "Закрыта" as Closed

    [*] --> Opened : постановка
    Opened --> InProgress : назначение
    InProgress --> InReview : отправка на проверку
    InReview --> Reopened : Переоткрытие
    Reopened --> InProgress : Повторное<br>взятие<br>в работу
    InReview --> Passed : Одобрение
    Passed --> Closed : Закрытие
    Closed --> [*] 
```
